# Преобразовать элементы списка s из строковой в числовую форму
s = ["4", "56", "85"]
b = list(map(int, s))
print(b)
print("-----------------")
# Подсчитать количество различных элементов в последовательности s
s = ["abc", "56", "sun1", "2456"]
print(len(s))
print("-----------------")
# Обратить последовательность s без использования функций
s = "sentence"
new_str = ""
for i in s:
    new_str = i + new_str
print(new_str)
print("-----------------")
# Возвращает список индексов, по которым элемент x находится в последовательности s.
s = ["sun", "moon", "sea", "mountain"]
x = 'sea'
print(s.index(x))
print("-----------------")
# Добавьте элементы списка s с четными индексами
s = [1, 2, 3, 4, 5]
for x in range(len(s)):
    s.insert(2 * x + 1, 0)
print(s)
print("-----------------")
# Найдите строку максимальной длины в списке строк s
s = ['123', '123456', '1234']
print(max(s, key=len))
